{
  "class_name": "Model",
  "config": {
    "name": "model_1",
    "layers": [
      {
        "name": "input_1",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            70,
            160,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_1"
        },
        "inbound_nodes": []
      },
      {
        "name": "input_2",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            70,
            160,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_2"
        },
        "inbound_nodes": []
      },
      {
        "name": "sequential_1",
        "class_name": "Sequential",
        "config": [
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                70,
                160,
                1
              ],
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "trainable": true,
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_1",
              "trainable": true,
              "activation": "relu"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_2",
              "trainable": true,
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_2",
              "trainable": true,
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_2",
              "trainable": true,
              "activation": "relu"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "units": 32,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "sequential_2",
        "class_name": "Sequential",
        "config": [
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_3",
              "trainable": true,
              "batch_input_shape": [
                null,
                70,
                160,
                1
              ],
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_3",
              "trainable": true,
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_3",
              "trainable": true,
              "activation": "relu"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_4",
              "trainable": true,
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_4",
              "trainable": true,
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_2",
              "trainable": true,
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_4",
              "trainable": true,
              "activation": "relu"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_2",
              "trainable": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "units": 32,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "inbound_nodes": [
          [
            [
              "input_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "lambda_1",
        "class_name": "Lambda",
        "config": {
          "name": "lambda_1",
          "trainable": true,
          "function": [
            "4wEAAAAAAAAABwAAAAUAAABDAAAAc0gAAAB8AGQBGQB8AGQCGQACAH0BfQJ0AGoBfAF8AoMCfQN0\nAGoCfANkA4MCfQR0AGoDfARkAmQEZAWNA30FdABqBHwFgwF9BnwGUwApBk7pAAAAAOkBAAAA6QIA\nAABUKQHaCWtlZXBfZGltcykF2gFU2ghzdWJ0cmFjdNoDcG932gpyZWR1Y2Vfc3Vt2gRzcXJ0KQfa\nBHBhaXLaAXXaAXbaBGRpZmbaA3NxctoEc3VtX9oEZGlzdKkAchEAAAD6C2RsX3Byb2oxLnB52hpz\naWFtZXNlX2V1Y2xpZGVhbl9kaXN0YW5jZSoAAABzDAAAAAACEgEMAQwBEAEKAQ==\n",
            null,
            null
          ],
          "function_type": "lambda",
          "output_shape": null,
          "output_shape_type": "raw",
          "arguments": {}
        },
        "inbound_nodes": [
          [
            [
              "sequential_1",
              1,
              0,
              {}
            ],
            [
              "sequential_2",
              1,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_1",
        0,
        0
      ],
      [
        "input_2",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "lambda_1",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.1.3",
  "backend": "tensorflow"
}
